// 软件版本号
String version = "1.1.1";

// 后端地址
String config_baseURL = "https://api.xbt.example.com";

// 签到预设位置，经纬度可以从https://api.map.baidu.com/lbsapi/getpoint/获取(百度坐标系)
// description为教师端显示的位置信息，可以自己在学习通创建班级作为教师账号，发布位置签到->选择位置界面查看
// name为客户端位置缩写，可自行命名
List<Map<String, dynamic>> config_locationPreset = [
  {"name": "一号教学楼", "lng": '104.195155', "lat": '30.654549', "description": "成都市龙泉驿区XA03成都大学-第一教学楼"},
  {"name": "二号教学楼", "lng": '104.195676', "lat": '30.655039', "description": "四川省成都市龙泉驿区成洛大道2025号成都大学-第二教学楼"},
  {"name": "三号教学楼", "lng": '104.196078', "lat": '30.655429', "description": "四川省成都市龙泉驿区成洛大道2025号成都大学-第三教学楼"},
  {"name": "四号教学楼", "lng": '104.196734', "lat": '30.656081', "description": "四川省成都市龙泉驿区成洛大道2025号成都大学-第四教学楼"},
  {"name": "五号教学楼", "lng": '104.197228', "lat": '30.656462', "description": "四川省成都市龙泉驿区成洛大道2025号成都大学-第五教学楼"},
  {"name": "六号教学楼", "lng": '104.197875', "lat": '30.656959', "description": "四川省成都市龙泉驿区成洛大道2025号成都大学-第六教学楼"},
  {"name": "七号教学楼", "lng": '104.198023', "lat": '30.655774', "description": "成都市龙泉驿区致远路成都大学第七教学楼"},
  {"name": "八号教学楼", "lng": '104.198719', "lat": '30.659048', "description": "四川省成都市龙泉驿区成洛大道2025号成都大学-第八教学楼"},
  {"name": "九号教学楼", "lng": '104.198724', "lat": '30.661448', "description": "四川省成都市龙泉驿区十陵上街1号成都大学-第九教学楼"},
  {"name": "十号教学楼", "lng": '104.20096', "lat": '30.662395', "description": "四川省成都市龙泉驿区成洛大道2025号成都大学-第10教学楼"},
  {"name": "十一号教学楼", "lng": '104.203835', "lat": '30.661696', "description": "成都市龙泉驿区锦城北路成都大学成都大学11号教学楼"},
  {"name": "十二号教学楼", "lng": '104.204001', "lat": '30.661094', "description": "成都市龙泉驿区锦城北路成都大学成都大学-12号教学楼"},
  {"name": "十三号教学楼", "lng": '104.205932', "lat": '30.661044', "description": "四川省成都市龙泉驿区十陵街道成都大学-北区成都大学13号教学楼"},
  {"name": "十四号教学楼", "lng": '104.206233', "lat": '30.661611', "description": "四川省成都市龙泉驿区西河街道成都大学-北区成都大学14号教学楼"},
  {"name": "十五号教学楼", "lng": '104.20459', "lat": '30.663545', "description": "四川省成都市龙泉驿区十陵街道友谊东路大运村室外篮球场"},
  {"name": "十六号教学楼", "lng": '104.206206', "lat": '30.663366', "description": "四川省成都市龙泉驿区成洛大道2025号成都大学15栋对面成都大学-橙园16舍"},
  {"name": "十七号教学楼", "lng": '104.207141', "lat": '30.663568', "description": "四川省成都市龙泉驿区成洛大道2025号成都大学综合楼成都大学斯特灵学院-阅览室"},
  {"name": "十八号教学楼", "lng": '104.207922', "lat": '30.663389', "description": "四川省成都市龙泉驿区锦城北路成都大学成都大学宿舍-18栋"}
];
